{
  "apiKeyRequired": "Vui lòng cài đặt khóa API trong phần cài đặt trước.",
  "geminiApiKeyRequired": "Không tìm thấy khóa API Gemini",
  "invalidInput": "Vui lòng cung cấp đầu vào hợp lệ (URL YouTube, kết quả tìm kiếm, hoặc tập tin tải lên).",
  "invalidFile": "Định dạng hoặc kích thước tập tin không hợp lệ. Kiểm tra các định dạng được hỗ trợ.",
  "geminiOverloaded": "Mô hình mạnh có xu hướng bị quá tải, vui lòng cân nhắc sử dụng mô hình khác và thử lại, hoặc thử giảm thời lượng phân đoạn. Cách khác: tạo Google Cloud Project mới và lấy API Key.",
  "tokenLimitExceeded": "Phần video quá lớn để Gemini xử lý. Vui lòng thử với video ngắn hơn hoặc chất lượng video thấp hơn.",
  "tokenLimitExceededCounts": "Phần video quá lớn để Gemini xử lý (độ dài yêu cầu {{required}} token, độ dài giới hạn {{limit}} token). Vui lòng giảm FPS/chất lượng hoặc rút ngắn độ dài mỗi request rồi thử lại.",
  "fileSizeTooLarge": "Kích thước tập tin ({{size}}MB) vượt quá giới hạn đề nghị {{maxSize}}MB. Vui lòng sử dụng tập tin nhỏ hơn hoặc video chất lượng thấp hơn.",
  "youtubeAuthRequired": "Yêu cầu xác thực YouTube. Vui lòng thiết lập OAuth trong cài đặt.",
  "youtubeApiKeyRequired": "Vui lòng cài đặt khóa API YouTube trong cài đặt để sử dụng ứng dụng này.",
  "bothKeysRequired": "Vui lòng cài đặt khóa API Gemini và cấu hình xác thực YouTube trong cài đặt để sử dụng ứng dụng này.",
  "youtubeApiNotEnabled": "YouTube Data API v3 chưa được kích hoạt trong dự án Google Cloud của bạn. Vui lòng kích hoạt bằng cách truy cập Google Cloud Console và bật dịch vụ YouTube Data API v3.",
  "quotaExceeded": "Đã vượt quá hạn ngạch, vui lòng đợi đến ngày mai, hoặc tạo dự án Google Cloud mới và cập nhật API hoặc OAuth.",
  "contentBlocked": "Nội dung video không an toàn và đã bị Gemini chặn",
  "paidTierRequired": "Đã vượt quá hạn ngạch API. Vui lòng thử lại sau hoặc kiểm tra giới hạn khóa API của bạn.",
  "apiQuotaExceeded": "API key hiện tại đang quá tải, vui lòng dùng key từ gmail khác, hoặc đợi 1 thời gian, hoặc nạp tiền vào <a href='https://aistudio.google.com/usage?tab=billing' target='_blank' rel='noopener noreferrer'>Gemini API Billing</a>",
  "geminiQuotaExceededWithRetry": "Đã vượt quá hạn ngạch Gemini. Vui lòng đợi khoảng {{seconds}} giây rồi thử lại, hoặc dùng API key khác/thêm thanh toán.",
  "geminiQuotaExceeded": "Đã vượt quá hạn ngạch Gemini. Vui lòng thử lại sau hoặc dùng API key khác/thêm thanh toán.",
  "geminiServiceUnavailable": "Phía Gemini hiện đang quá tải, hãy chờ hoặc đổi mô hình và thử lại sau (mã lỗi 503)",
  "invalidSrtFile": "Vui lòng chọn tập tin SRT hợp lệ",
  "invalidSubtitleFile": "Vui lòng chọn tập tin SRT hoặc JSON phụ đề hợp lệ",
  "invalidJsonFile": "Tập tin JSON phải chứa một mảng phụ đề",
  "invalidJsonFormat": "Định dạng JSON không hợp lệ",
  "invalidJsonStructure": "Phụ đề JSON phải có các thuộc tính start, end và text",
  "noNarrationResults": "Không có kết quả thuyết minh để tạo âm thanh đồng bộ",
  "requestAborted": "Yêu cầu đã bị hủy",
  "processingCancelled": "Người dùng đã hủy quá trình xử lý",
  "allRequestsAborted": "Tất cả các yêu cầu đã bị hủy",
  "parakeetApiError": "Lỗi API Parakeet: {{status}} {{errorText}}",
  "invalidSegmentSelection": "Lựa chọn phân đoạn không hợp lệ"
}
